In [21]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [22]:
ar1 = np.arange(4)
ar1

array([0, 1, 2, 3])

In [23]:
ar1 = np.arange(4).reshape(2,2)

In [38]:
np.concatenate([ar1,ar1],0)

array([[0, 1],
       [2, 3],
       [0, 1],
       [2, 3]])

In [40]:
df1 = DataFrame({
    'a':[1,2,3],
    'b':[4,5,6]
})
df1

   a  b
0  1  4
1  2  5
2  3  6

In [42]:
df2 = DataFrame({
    'a':[10,11],
    'b':[40,50]
})
df2

    a   b
0  10  40
1  11  50

In [44]:
df3 = DataFrame({
    'a':[40,50,60],
    'b':[70,80,90],
    'c':[10,11,12]
})
df3

    a   b   c
0  40  70  10
1  50  80  11
2  60  90  12

In [51]:
pd.concat([df1,df2])

    a   b
0   1   4
1   2   5
2   3   6
0  10  40
1  11  50

In [55]:
pd.concat([df1,df2],1)

   a  b     a     b
0  1  4  10.0  40.0
1  2  5  11.0  50.0
2  3  6   NaN   NaN

In [80]:
print(pd.concat([df1,df2], axis=1,join='inner'))
print(pd.concat([df1,df2], axis=1,join='inner',keys=['one','two']))

   a  b   a   b
0  1  4  10  40
1  2  5  11  50
  one    two
    a  b   a   b
0   1  4  10  40
1   2  5  11  50

In [84]:
pd.concat([df1,df2], axis=0,join='inner',keys=['ONE','TWO'])

        a   b
ONE 0   1   4
    1   2   5
    2   3   6
TWO 0  10  40
    1  11  50

In [87]:
df1 = DataFrame({
    'A':[1,2,3,4],
    'B':[5,6,7,8],
    'C':[9,10,11,12]
})
print(df1)

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [102]:
df2 = DataFrame({
    'A':['a','b','c','d'],
    'D':['e','f','g','h'],
    'E':['i','j','k','l']
})
print(df2)

   A  D  E
0  a  e  i
1  b  f  j
2  c  g  k
3  d  h  l

In [104]:
df1.combine_first(df2)

   A  B   C  D  E
0  1  5   9  e  i
1  2  6  10  f  j
2  3  7  11  g  k
3  4  8  12  h  l